emthy0/Embed-IOT/esp8266/src/main.cpp
#include <SoftwareSerial.h>
#include <ESP8266WiFi.h>
#include <BlynkSimpleEsp8266_SSL.h>
#define BLYNK_TEMPLATE_ID "TMPL6rXyIyR1E"
#define BLYNK_TEMPLATE_NAME "SMARTCURTAIN"
#define BLYNK_AUTH_TOKEN "drFzungMkQBmEgqMe5r8Q8_wVuwsa_4Q"
#define SSID "OnePlus 10 Pro 5G"
#define PASS "aaaaaaaa"

#define STM_RX D5
#define STM_TX D4

SoftwareSerial chat(STM_RX, STM_TX); // RX, TX

String a;

void setup() {

  Serial.begin(9600);

  chat.begin(4800);

  Blynk.begin(BLYNK_AUTH_TOKEN ,SSID,PASS);

  delay(10);

}
int mode = 0;
void loop() {

Serial.println("Please wait Serial..");
if(mode == 0){
  while (a == "") {

    chat.print("Q1"); // ส่งหัวข้อคำถาม ว่า Question1 ไปยัง Arduino
    
    a = chat.readString();  // อ่าน Serial และนำไปเก็บในตัวแปร A

    Serial.print(a);

    delay(100);

    Serial.print(".Q1.");

 

  }
  a = "";
  mode = 1;
}
else{
  while (a == "") {

    chat.print("Q2"); // ส่งหัวข้อคำถาม ว่า Question1 ไปยัง Arduino
    
    a = chat.readString();  // อ่าน Serial และนำไปเก็บในตัวแปร A

    Serial.print(a);

    delay(100);

    Serial.print(".Q2.");

 

  }
  a = "";
  mode = 0;
}
}